const { cmd } = require("../command");

cmd(
  {
    pattern: "alive",
    react: "🤖",
    desc: "Show bot status",
    category: "main",
    filename: __filename,
    fromMe: false,
  },
  async (malvin, mek, m, { reply }) => {
    try {
      const from = mek.key.remoteJid;

      await malvin.sendPresenceUpdate("recording", from);

      // Alive Image & Caption
      await malvin.sendMessage(
        from,
        {
          image: {
            url: "https://files.catbox.moe/5a19t0.jpg",
          },
          caption: `   
          
> PRIVATE BOT 𝗜𝗦 𝗔𝗟𝗜𝗩𝗘 𝗡𝗢𝗪


> THIS IS MY IDEA OF VERSION 2
          
╭━〔*🚀 PRIVATE-BOT🚀*〕━━┈⊷
┃❒╭────────────
┃❒│ 👑 *ʀᴜɴᴛɪᴍᴇ:* 1 hour, 49 minutes, 39 seconds
┃❒│ 🕹️ *ᴍᴏᴅᴇ:* *public*
┃❒│ 🎯 *ᴘʀᴇғɪx:* *.*
┃❒│ 💡 *ʀᴀᴍ ᴜsᴇ:* 56.11 GB / 63276 GB
┃❒│ 👑 *ᴅᴇᴠ:* *SIGMA TECH*
┃❒│ 🚀 *ᴠᴇʀsɪᴏɴ:* *2.0.0*
┃❒╰────────────────
╰━━━━━━━━━━━━━━━━━━┈⊷

╔══════════════════╣
║ *ᴄᴏɴᴠᴇʀᴛᴇʀ ᴍᴇɴᴜ* 
╠══════════════════╣
║ •💫 ɢᴘᴛ 
║ •💫 ᴀɪ 
║ •💫 ᴠᴠ 
║ •💫 ᴠᴠ𝟮 
║ •💫 ʙɪʙʟᴇ 
║ •💫 ᴄʜᴀɴɴᴇʟ
║ •💫 ᴜɴʙʟᴏᴄᴋ 
║ •💫 ʙʟᴏᴄᴋ 
║ •💫 ᴜᴘᴛɪᴍᴇ
║ •💫 ᴄʜᴇᴄᴋᴜᴘᴅᴀᴛᴇ 
║ •💫 ᴄʜᴇᴄᴋ
║ •💫 ᴊɪᴅ 
║ •✨ ᴘɪɴɢ 
║ •💫 ᴘᴀɪʀ
║ •✨ ᴏᴡɴᴇʀ 
║ •💫 ɢᴇᴛᴘᴘ 
║ •💫 ɢɪᴛᴄʟᴏɴᴇ 
║ •💫 ɢɪᴛʜᴜʙ 
║ •🎭 ʟɪ𝘀ᴛᴏɴʟɪɴᴇ 
║ •🎭 ʟᴏɢᴏᴍᴇɴᴜ 
║ •🎭 ᴀʟɪᴠᴇ 
║ •🎭 ᴍᴇɴᴜ 
║ •✨ ʀᴇᴘᴏ 
║ •🎭 𝘀ᴛᴀʙʟᴇᴅɪғғᴜ𝘀ɪᴏɴ 
║ •💫 ᴇʙɪɴᴀʀʏ 
║ •💫 ᴅʙɪɴᴀʀʏ 
║ •💫 ᴍᴘ𝟯 
║ •💫 ᴀᴛᴛᴘ 
║ •✨ ᴘᴏ𝘀ᴛ 
║ •✨ ʜᴀᴄᴋ 
║ •✨ ǫᴜʀᴀɴ 
║ •✨ ǫᴜʀᴀɴᴍᴇɴᴜ
║ •✨ ʀᴇ𝘀ᴛᴀʀᴛ 
║ •✨ 𝘀ᴇɴᴅ 
║ •✨ 𝘀ᴛɪᴄᴋᴇʀ 
║ •✨ ᴛᴀᴋᴇ 
║ •✨ ᴘᴇʀ𝘀ᴏɴ 
╠═══════════════════╣
║ *ᴛᴏᴏʟ𝘀 ᴍᴇɴᴜ* 
╠══════════════════╣
║ •🎭 ғʙ
║ •🎭 ᴘʟᴀʏ 
║ •🎭 ᴘʟᴀʏ𝟭 
║ •🎭 ᴘʟᴀʏ𝟮 
║ •🎭 ᴀᴘᴋ 
║ •🎭 ᴠɪᴅᴇᴏ 
║ •🎭 ᴠɪᴅᴇᴏ𝟭 
║ •🎭 ɪᴍɢ 
║ •🎭 ᴛɪᴋᴛᴏᴋ 
║ •🎭 ғᴀɴᴄʏ 
║ •🎭 ɢᴇᴛɪᴍᴀɢᴇ 
║ •🎭 ɪᴍɢ𝘀ᴄᴀɴ 
║ •🎭 𝘀ᴛᴀʙɪʟɪᴛʏᴀɪ 
║ •🎭 ғʟᴜ𝘅ᴀɪ 
║ •🎭 ɪʏʀɪᴄ𝘀 
║ •✨ ᴍᴏᴠɪᴇ 
║ •✨ 𝘀ᴄʀᴇᴇɴ𝘀ʜᴏᴛ 
║ •✨ ʀᴡ 
║ •✨ ᴛɪɴʏ 
║ •✨ ᴛɪᴋᴛᴏᴋ𝘀ᴇᴀʀᴄʜ 
║ •✨ ᴛᴏᴘᴛᴛ 
║ •✨ ᴛᴏᴍᴘ𝟯 
║ •✨ ᴄᴏɴᴠᴇʀᴛ 
║ •✨ ᴠ𝘀ᴛɪᴄᴋᴇʀ
║ •✨ ᴛʀᴛ 
║ •✨ ᴛɪᴋᴛᴏᴋ𝟮 
║ •✨ ᴜʀʟ 
║ •✨ ᴡᴇᴀᴛʜᴇʀ 
║ •✨ ᴀɪᴠᴏɪᴄᴇ 
╠════════════════════╣
║ *ɢʀᴏᴜᴘ ᴍᴇɴᴜ* 
╠════════════════════╣
║ •👤 ʀᴇᴊᴇᴄᴛᴀʟʟ
║ •👤 ᴀᴄᴄᴇᴘᴛᴀʟʟ 
║ •👤 ʀᴇǫᴜᴇ𝘀ᴛʟɪ𝘀ᴛ 
║ •👤 ɢᴅᴇ𝘀ᴄ 
║ •👤 ᴅᴇᴍᴏᴛᴇ 
║ •👤 ᴀᴅᴍɪɴ 
║ •👤 ᴀᴅᴅ 
║ •👤 ᴋɪᴄᴋ 
║ •👤 ʜɪᴅᴇᴛᴀɢ
║ •👤 ᴛᴀɢᴀʟʟ 
║ •👤 ᴀɴᴛɪʟɪɴᴋ 
║ •👤 ᴘʀᴏᴍᴏᴛᴇ
║ •👤 𝘀ᴇᴛᴅᴇ𝘀ᴄ
║ •👤 ɢʀᴏᴜᴘ 
║ •👤 ɢᴄ𝘀ᴇᴛᴛɪɴɢ 
║ •👤 ᴡᴇʟᴄᴏᴍᴇ
║ •👤 ɢɴᴀᴍᴇ 
║ •👤 ɢɪɴғᴏ 
║ •👤 ᴊᴏɪɴ 
║ •👤 ɪɴᴠɪᴛᴇʟ 
║ •👤 ᴠᴄғʟ 
║ •👤 ʟᴇғᴛ 
║ •👤 ɴᴇᴡɢᴄ 
║ •👤 ᴍᴜᴛᴇ 
║ •👤 ʟᴏᴄᴋɢᴄ 
║ •👤 ᴏᴜᴛ 
║ •👤 ʀᴇᴍᴏᴠᴇᴀʟʟ𝟮 
║ •👤 ʀᴇᴍᴏᴠᴇᴀᴅᴍɪɴ𝘀 
║ •👤 ᴜɴʟᴏᴄᴋɢᴄ 
║ •👤 ᴜɴᴍᴜᴛᴇʟ
║ •👤 ᴛᴀɢᴀᴅᴍɪɴ𝘀 
╠═══════════════════╣
║ *ᴍᴀɪɴ ᴍᴇɴᴜ* 
╠═════════════════════╣
║ •✨ ᴀᴜᴛᴏ-ᴛʏᴘɪɴɢ
║ •✨ ᴍᴏᴅᴇ 
║ •✨ ᴍᴇɴᴛɪᴏɴ-ʀᴇᴘʟʏ 
║ •✨ ᴀʟᴡᴀʏ𝘀-ᴏɴʟɪɴᴇ 
║ •✨ ᴀᴜᴛᴏ-ʀᴇᴄᴏʀᴅɪɴɢ
║ •✨ 𝘀ᴛᴀᴛᴜ𝘀-ʀᴇᴀᴄᴛ 
║ •✨ ʀᴇᴀᴅ-ᴍᴇ𝘀𝘀ᴀɢᴇ 
║ •✨ ᴀᴜᴛᴏ-ᴠᴏɪᴄᴇ
║ •✨ ᴀᴜᴛᴏ-ʀᴇᴘʟʏ 
║ •✨ ᴀᴜᴛᴏ-ʀᴇᴀᴄᴛ
║ •✨ 𝘀ᴛᴀᴛᴜ𝘀-ʀᴇᴘʟʏ 
║ •✨ ᴅᴇʟᴇᴛᴇʟɪɴᴋ 
║ •✨ ᴀɴᴛɪʟɪɴᴋ 
║ •✨ ᴀɴᴛɪʟɪɴᴋᴋɪᴄᴋ 
║ •✨ ᴀɴᴛɪᴄᴀʟʟ 
║ •✨ ʙʟᴏᴄᴋʟɪ𝘀ᴛ 
║ •✨ ɢᴇᴛʙɪᴏ 
╚════════════════════╣

> ᴘᴏᴡᴇʀᴇᴅ ʙʏ alpha king
`,
        },
        { quoted: mek }
      );

      // Delay
      await new Promise((resolve) => setTimeout(resolve, 1000));

      // Voice Message
      await malvin.sendMessage(
        from,
        {
          audio: {
            url: "https://files.catbox.moe/48y9bg.mp3",
          },
          mimetype: "m4a/mp3",
          ptt: true,
        },
        { quoted: mek }
      );
    } catch (e) {
      console.error("❌ Error in .alive command:", e);
      reply("❌ Error while sending alive message!");
    }
          })
